{
    "file": "site\/modules\/FormBuilder\/ProcessFormBuilderEmbed.php",
    "textdomain": "site--modules--formbuilder--processformbuilderembed-php",
    "translations": {
        "76d471da25c1985c3f6afda784b48aef": {
            "text": "Wichtig: Vermeide, wenn möglich das Zwischenspeichern mit z. B. ProCache oder Template-Cache. Wenn die Ausgabe des Formulars (oder der Seite, auf der es erscheint) zwischengespeichert werden muss, aktiviere auf der Registerkarte „Einstellungen“ das Kontrollkästchen „Sessionverfolgung und CSRF-Schutz deaktivieren?“"
        },
        "d4661cd7ff3d8cbd671dada7101f9ba0": {
            "text": "Wichtige Hinweise"
        },
        "b56a01ad0dab976d4f6f240a51a5dd89": {
            "text": "Welche Einbettungsmethode sollte verwendet werden?"
        },
        "6aff657961ecfd7ff922d2adc34eb714": {
            "text": "Wir empfehlen, wann immer möglich, die Einbettungsmethode C zu verwenden, da sie das beste Gleichgewicht zwischen Flexibilität, Anpassbarkeit und Funktionen bietet."
        },
        "a66794c79dc8429a9ad016e5cba6b93d": {
            "text": "Für die Einbettung an einer beliebiger Stelle ohne Template-Bearbeitung, sollte Methode A gewählt werden."
        },
        "6d5878366e0bb3d21d9a80736e5f0cb3": {
            "text": "Für die volle Markup-Kontrolle sollte die Methode D verwendet werden. Beachte die Einschränkungen bei Formularaktionen und Plugins und mögliche Schwierigkeiten bei späteren Formularänderungen."
        },
        "71cf6c5627566f1131307ce702ec09bf": {
            "text": "Um eine reibungslose Funktionalität sicherzustellen ist gründliches Testen des Formulars im Frontend der Website ist sehr wichtig, unabhängig von der gewählten Einbettungsmethode."
        },
        "8e60c203dc83e72f9c24d6d253e8a322": {
            "text": "Das Formular mindestens zweimal senden, um Speicherung und Versand des abgeschickten Eintrags zu überprüfen."
        },
        "d0d612a19cfe30bbf71a1bcc3ac9021c": {
            "text": "Gründliches Testen neuer Formulare oder Änderungen an bestehenden Formularen ist immer ratsam. Gleiches gilt für Tests aller Formulare bei der Einführung neuer FormBuilder- oder ProcessWire-Versionen."
        },
        "e0a47a832de0f038d3879fe0d1315126": {
            "text": "Um fortzufahren, wähle bitte eine Einbettungsmethode:"
        },
        "b38fa2472d38a8d3e13059fc4187071d": {
            "text": "Option A: Einfaches Einbetten"
        },
        "b9746c20baf32e962b4de6cdd0be1338": {
            "text": "Für die Ausgabe des Formulars, füge den Tag in deinen Text ein:"
        },
        "b3864067ffc6c8b25974959ab501652f": {
            "text": "Der Tag muss in einen Absatz (p) oder eine Überschrift (h1, h2, h3, h4) eingefügt werden und muss das einzige Element darin sein."
        },
        "59451d25ebc5ca525e092f0317582be3": {
            "text": "Speichern und anzeigen der Seite, um das Formular zu sehen."
        },
        "efbb2d876f90053947d700da3b6aa2ed": {
            "text": "Wenn Sie diese einfache Einbettungsoption in anderen Feldern unterstützen möchten, können Sie in den Einstellungen des Form Builder-Moduls weitere Felder hinzufügen."
        },
        "173d0d2374e81aa671d047fb3205c2b9": {
            "text": "Diese Einbettungsoption erfordert mindestens ein aktiviertes Einbettungsfeld, das in den Einstellungen des Form Builder-Moduls konfiguriert werden kann."
        },
        "77cf778e6b38d7dc52b78d965504acf9": {
            "text": "Option B:  Einbetten in Template (iFrame)"
        },
        "214e90e72d84551a0c2a57c4a561d5f3": {
            "text": "Füge den Einbettungscode in das Template ein."
        },
        "c4fff15bb884e7a7c8e68bdc8006ef54": {
            "text": "Verwende diese Option, um das Formular aus einer Template-Datei statt aus einem Feld zu laden."
        },
        "c8801454be0ea5167eac0e820c4c9445": {
            "text": "Diese Option bietet mehr definierte Platzierungsoptionen im Vergleich zu Option A, erfordert jedoch die Bearbeitung einer Template-Datei."
        },
        "c3c8aba5ea14b989b9733f996334baeb": {
            "text": "Kopiere den folgenden Code in die Template-Datei(en) wo das Formular ausgegeben werden soll:"
        },
        "4fb444ad8c9e1e02cefe4baf15e43b4e": {
            "text": "Option C: Einbetten in Template (empfohlen)"
        },
        "8473fa494e094775e4025933225c6660": {
            "text": "Rendern des Formulars direkt aus der Template-Datei (kein Iframe)."
        },
        "f2f8dc604b5243dda3ce124dc774c0ae": {
            "text": "Diese Option wird für die meisten Fälle empfohlen, da sie die beste Balance zwischen Flexibilität, Anpassung und Funktionen bietet. Sie ist mit allen FormBuilder-Aktionen und -Plugins kompatibel."
        },
        "f2775cda06a77efb69765fccd3e96779": {
            "text": "Das Markup wird direkt in der Seite ausgegeben, daher können die CSS-Stile Ihrer Website das Erscheinungsbild beeinflussen."
        },
        "d66f603867b8ab7bfbd3b6435ffa44fd": {
            "text": "Wenn bereits ein kompatibles CSS-Framework wie Uikit oder Bootstrap verwendet wird, ist die Einbettungsmethode C möglicherweise ideal, da das Markup für das Framework vorbereitet ist."
        },
        "b2b5c3eac75aa3071520ef4eb84c7def": {
            "text": "Wenn kein CSS-Framework verwendet wird, wähle „Standard“ als Ausgabe-Framework (im Tab „Ausgabe“). Beachte, dass es notwendig sein kann, das Aussehen des Formulars mit weiteren CSS-Stilen zu optimieren."
        },
        "bcefb15c742e1a034ee536a780108303": {
            "text": "Kopiere den folgenden Code und füge ihn in die Template-Datei an der entsprechenden Stelle ein. Passe ihn bei Bedarf an."
        },
        "a5f7bf3fe4046bd0ba95ab7cf9ed8856": {
            "text": "Füge den Code vor Beginn der Ausgabe z. B. in einer _init.php-Datei oder am Anfang einer Template-Datei ein."
        },
        "918c4d7bdbf0b5e7eae66fbac602241b": {
            "text": "Platziere den Code innerhalb des <head><\/head>-Bereichs, dort wo du auch CSS- und JS-Dateien ausgibst."
        },
        "fb3fc0f16b6048d5eedf00d08572adaf": {
            "text": "Diese beiden Zeilen können je nach Bedarf aufgeteilt oder mit der oben genannten Zeile kombiniert werden."
        },
        "01001be75f2a2961960448a277aeb868": {
            "text": "Platziere den Code an einer Stelle im Dokument <body>, wo das Formular gerendert werden soll:"
        },
        "2d4c9e9c90492b5c612dcb6092f1e1db": {
            "text": "Option D: Eigenes Markup"
        },
        "27f74f78aa391a8f1079059edbb04af4": {
            "text": "Mit dieser Option kann das gesamte Markup des Formulars angepasst werden, indem es direkt in die Template-Datei geschrieben wird."
        },
        "54bba052bfd381ff5cc3f1fc93acfc0c": {
            "text": "Beachte jedoch mögliche Einschränkungen bei Aktionen und Plugins sowie den zusätzlichen Aufwand für zukünftige Änderungen am Formular."
        },
        "6185c9ce51e6e17f6344b202f5e39df6": {
            "text": "Verwende diese Option erst, wenn das Formular „fertig“ ist, da nach einer Änderung manuelle Anpassungen am Markup erforderlich sind."
        },
        "9203aaba861915344955cd39ccb3ba08": {
            "text": "Klicke hier, um das Markup des Formulars zu erstellen."
        },
        "eb944faee6acea3ce2706e2b4c71d934": {
            "text": "Es wird in die folgende Datei geschrieben:"
        },
        "c327370eb2e34ea05e4c28ba81353198": {
            "text": "Kopieren Sie die oben genannte Datei in diese Datei:"
        },
        "f565961e6f0e8e91a6f51750dff6061d": {
            "text": "Bearbeiten Sie die oben kopierte Datei und folgen Sie den Anweisungen in den Kommentaren der Datei."
        },
        "d0f1d36da213f4df8bd401cfb90b619a": {
            "text": "Fügen Sie Folgendes in eine Vorlagendatei ein, in der Sie das Formular ausgeben möchten:"
        },
        "6e3eb57296a5ba9a87c3ca387c6e2972": {
            "text": "Hinweis: In Ihrer ProcessWire-Installation ist eine Sicherheitsfunktion namens Session Fingerprint aktiviert."
        },
        "bb01eb3ecb259f13a7953f5a1ac269b6": {
            "text": "Wenn Benutzer Ihres Formulars IP-Adressen haben, die sich ändern können, während sie ein Formular ausfüllen, sollten Sie das Session-Tracking\/CSRF-Schutz für dieses Formular deaktivieren (siehe Registerkarte Einstellungen) oder eine andere %s-Einstellung in der Datei \/site\/config.php hinzufügen."
        },
        "a08e1bacb7f7ea108e8bbdd85b92e428": {
            "text": "Dies ist die einfachste Methode, bei der nichts weiter getan werden muss, als eine Seite zu bearbeiten und den folgenden Tag an der gewünschten Stelle einzufügen (%s)."
        }
    }
}